evan-dp/NordicSDKs/nRF5_SDK_for_Thread_v0.11.0_84a130f/components/iot/background_dfu/transport/coap/coap_dfu.c
/**
 * Copyright (c) 2017 - 2017, Nordic Semiconductor ASA
 * 
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 * 
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 * 
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 * 
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 * 
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */

/** @file
 *
 * @defgroup background_dfu_coap_transport background_dfu_coap.c
 * @{
 * @ingroup background_dfu
 * @brief Background DFU CoAP transport implementation.
 *
 */

#include "background_dfu_transport.h"
#include "coap_dfu.h"

#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>
#include "sdk_config.h"
#include "boards.h"
#include "app_util.h"
#include "app_timer.h"
#include "nrf_error.h"
#include "nrf_dfu_settings.h"
#include "nrf_dfu_req_handler.h"
#include "nordic_common.h"
#include "iot_errors.h"
#include "coap_api.h"
#include "coap_block.h"
#include "coap_option.h"
#include "background_dfu_block.h"
#include "openthread/platform/random.h"

#define NRF_LOG_LEVEL 4
#define NRF_LOG_MODULE_NAME COAP_DFU
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

/** @brief Maximum delay (in ms) between requesting consecutive image blocks. */
#define DEFAULT_DELAY_MAX_MS    128

#define REALM_LOCAL_ADDR        (uint8_t []){0xff, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, \
                                             0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01}

#ifndef DFU_DEBUG_RANDOM_INIT_BLOCK_LOSS_ENABLE
#define DFU_DEBUG_RANDOM_INIT_BLOCK_LOSS_ENABLE  0  /**< Enable random init block loss for debugging purposes. */
#endif

#ifndef DFU_DEBUG_RANDOM_IMAGE_BLOCK_LOSS_ENABLE
#define DFU_DEBUG_RANDOM_IMAGE_BLOCK_LOSS_ENABLE 0  /**< Enable random image block loss for debugging purposes. */
#endif

#ifndef DFU_DEBUG_RANDOM_BLOCK_LOSS_RATE
#define DFU_DEBUG_RANDOM_BLOCK_LOSS_RATE         50 /**< Block loss rate, in percent.*/
#endif

#define DFU_RESOURCE_PREFIX     "dfu"

#define INIT_RESOURCE_NAME      "i"
#define IMAGE_RESOURCE_NAME     "f"
#define TRIGGER_RESOURCE_NAME   "t"
#define DIAG_RESOURCE_NAME      "d"
#define BITMAP_RESOURCE_NAME    "b"
#define RESET_RESOURCE_NAME     "r"
#define RESOURCE_PATH(name)     (DFU_RESOURCE_PREFIX "/" name)

typedef struct
{
    coap_resource_t          root;            /**< Root resource. */
    coap_resource_t          prefix;          /**< Prefix resource. */
    coap_resource_t          trigger;         /**< Trigger resource. */
    coap_resource_t          init;            /**< Init resource. Used in multicast DFU transfer. */
    coap_resource_t          image;           /**< Image resource. Used in multicast DFU transfer. */
    coap_resource_t          diagnostic;      /**< Diagnostic resource. */
    coap_resource_t          reset;           /**< Reset resource. */

    coap_response_callback_t handler;         /**< A pointer to the current response handler. */
    const char             * p_resource_path; /**< Downloaded resource path on the remote host. */
    coap_remote_t            remote;          /**< Remote host from which the resource is being downloaded. */
    bool                     timer_active;    /**< True if a CoAP request is pending, false otherwise. */
} coap_dfu_context_t;

/** @brief Coap Message Id. */
static uint16_t m_coap_message_id = 0;

/** @brief CoAP token. */
static uint16_t m_coap_token;

/** @brief DFU client context. */
static background_dfu_context_t m_dfu_ctx;
static coap_dfu_context_t       m_coap_dfu_ctx;

/** @brief Request delay timer. */
APP_TIMER_DEF(m_send_timer);
APP_TIMER_DEF(m_reset_timer);

/** @brief Check if given address is multicast.
 *
 *  @param[in] p_remote A pointer to the address.
 *
 *  @return True if address is a multicast, false otherwise.
 **/
static bool is_addr_multicast(const coap_remote_t * p_remote)
{
    return p_remote->addr[0] == 0xff;
}

/***************************************************************************************************
 * @section Block processing
 **************************************************************************************************/

/** @brief Parse and return CoAP Block1 option from a given message.
 *
 *  @param[in]  p_message        A pointer to CoAP message.
 *  @param[out] p_block1_option  A pointer to parsed Block1 option.
 *
 *  @return True if message has Block1 option, false otherwise.
 */
static bool get_block1_opt(const coap_message_t    * p_message,
                           coap_block_opt_block1_t * p_block1_option)
{
    uint32_t        err_code;
    uint8_t         option_index;
    uint32_t        option_value;
    coap_option_t * p_option;

