evan-dp/NordicSDKs/nRF5_SDK_for_Thread_v0.11.0_84a130f/components/iot/background_dfu/transport/coap/coap_dfu.c
    if (coap_message_opt_index_get(&option_index,
                                   (coap_message_t *)p_message,
                                   COAP_OPT_BLOCK1) != NRF_SUCCESS)
    {
        return false;
    }

    p_option = (coap_option_t *)&p_message->options[option_index];
    err_code = coap_opt_uint_decode(&option_value,
                                    p_option->length,
                                    p_option->p_data);

    if (err_code != NRF_SUCCESS)
    {
        return false;
    }

    err_code = coap_block_opt_block1_decode(p_block1_option, option_value);

    return (err_code == NRF_SUCCESS);
}

/** @brief Parse and return CoAP block option from a given message.
 *
 *  @param[in]  p_message        A pointer to CoAP message.
 *  @param[out] p_block2_option  A pointer to parsed block 2 option.
 *
 *  @return True if message has Block2 option, false otherwise.
 */
static bool get_block2_opt(const coap_message_t    * p_message,
                           coap_block_opt_block2_t * p_block2_option)
{
    uint32_t        err_code;
    uint8_t         option_index;
    uint32_t        option_value;
    coap_option_t * p_option;

    if (coap_message_opt_index_get(&option_index,
                                   (coap_message_t *)p_message,
                                   COAP_OPT_BLOCK2) != NRF_SUCCESS)
    {
        return false;
    }

    p_option = (coap_option_t * )&p_message->options[option_index];
    err_code = coap_opt_uint_decode(&option_value,
                                    p_option->length,
                                    p_option->p_data);

    if (err_code != NRF_SUCCESS)
    {
        return false;
    }

    err_code = coap_block_opt_block2_decode(p_block2_option, option_value);

    return (err_code == NRF_SUCCESS);
}

/** @brief Set CoAP block2 option on a given message.
 *
 *  @param[inout]  p_message    A pointer to CoAP message.
 *  @param[in]     block_size   Block size to set.
 *  @param[in]     block_number Block number to set.
 *
 *  @return NRF_SUCCESS if succesful, error code otherwise.
 */
static uint32_t set_block2_opt(coap_message_t * p_message,
                               uint16_t         block_size,
                               uint32_t         block_number)
{
    uint32_t err_code;
    uint32_t option_value;

    coap_block_opt_block2_t block2_option =
    {
        .number = block_number,
        .size   = block_size
    };

    err_code = coap_block_opt_block2_encode(&option_value, &block2_option);
    if (err_code == NRF_SUCCESS)
    {
        err_code = coap_message_opt_uint_add(p_message, COAP_OPT_BLOCK2, option_value);
    }

    return err_code;
}

/***************************************************************************************************
 * @section Response handling
 **************************************************************************************************/

/**@brief Check status and common CoAP parameters for a response.
 *
 * @param[in] status     Status code indicating if response was received.
 * @param[in] p_response A response recevied. May be invalid if status is not NRF_SUCCESS.
 *
 * @return True if a valid response was received, false otherwise.
 */
static bool is_valid_response_received(uint32_t status, const coap_message_t * p_response)
{
    if (status != NRF_SUCCESS)
    {
        if (status == COAP_TRANSMISSION_TIMEOUT)
        {
            NRF_LOG_WARNING("Request timeout\r\n");
        }
        else
        {
            NRF_LOG_WARNING("Unknown error\r\n");
        }

        return false;
    }

    if (p_response->header.code != COAP_CODE_205_CONTENT)
    {
        NRF_LOG_WARNING("Request response code: %d\r\n", p_response->header.code);

        return false;
    }

    if ((p_response->header.token_len != sizeof(m_coap_token)) ||
        (memcmp(p_response->token, &m_coap_token, p_response->header.token_len) != 0))
    {
        NRF_LOG_WARNING("Token mismatch\r\n");

        return false;
    }

    return true;
}

/**@brief CoAP response handler for request sent to a trigger resource (@ref TRIGGER_RESOURCE_NAME).
 *
 * An implementation of @ref coap_response_callback_t function type.
 */
static void handle_trigger_response(uint32_t status, void * p_arg, coap_message_t * p_response)
{
    background_dfu_context_t * p_dfu_ctx = (background_dfu_context_t *)p_arg;

    if (p_dfu_ctx->dfu_state != BACKGROUND_DFU_DOWNLOAD_TRIG)
    {
        NRF_LOG_WARNING("Token response callback called in invalid state (s:%s)\r\n",
                (uint32_t)background_dfu_state_to_string(p_dfu_ctx->dfu_state));
        return;
    }

    if (!is_valid_response_received(status, p_response))
    {
        background_dfu_handle_event(&m_dfu_ctx, BACKGROUND_DFU_EVENT_TRANSFER_ERROR);
        return;
    }

    if (background_dfu_validate_trigger(&m_dfu_ctx, p_response->p_payload, p_response->payload_len))
    {
        m_coap_dfu_ctx.remote = p_response->remote;
        background_dfu_process_trigger(&m_dfu_ctx, p_response->p_payload, p_response->payload_len);
    }
}

/**@brief CoAP response handler for request sent to an init (@ref INIT_RESOURCE_NAME) or an image (@ref IMAGE_RESOURCE_NAME) resource.
 *
 * An implementation of @ref coap_response_callback_t function type.
 */
static void handle_block_response(uint32_t status, void * p_arg, coap_message_t * p_response)
{
    coap_block_opt_block2_t    block_opt = {0};
    background_dfu_context_t * p_dfu_ctx = (background_dfu_context_t *)p_arg;

    do
    {
        if ((p_dfu_ctx->dfu_state != BACKGROUND_DFU_DOWNLOAD_INIT_CMD) &&
            (p_dfu_ctx->dfu_state != BACKGROUND_DFU_DOWNLOAD_FIRMWARE))
        {
            NRF_LOG_WARNING("Block response callback called in invalid state (s:%s)\r\n",
                    (uint32_t)background_dfu_state_to_string(p_dfu_ctx->dfu_state));
            return;
        }

        if (!is_valid_response_received(status, p_response))
        {
            background_dfu_handle_event(&m_dfu_ctx, BACKGROUND_DFU_EVENT_TRANSFER_ERROR);
            break;
        }

