evan-dp/NordicSDKs/nRF5_SDK_for_Thread_v0.11.0_84a130f/components/iot/background_dfu/transport/coap/coap_dfu.c
        if (!get_block2_opt(p_response, &block_opt))
        {
            NRF_LOG_WARNING("No block 2 option in response message.\r\n");
            background_dfu_handle_event(p_dfu_ctx, BACKGROUND_DFU_EVENT_TRANSFER_CONTINUE);
            break;
        }

        NRF_LOG_DEBUG("Received block %3lu\r\n", block_opt.number);

        if (block_opt.number != p_dfu_ctx->block_num)
        {
            NRF_LOG_WARNING("Requested %d but got %d\r\n", p_dfu_ctx->block_num, block_opt.number);
            background_dfu_handle_event(p_dfu_ctx, BACKGROUND_DFU_EVENT_TRANSFER_CONTINUE);
            break;
        }

        background_dfu_block_t block;
        block.number    = block_opt.number;
        block.size      = block_opt.size;
        block.p_payload = p_response->p_payload;

        background_dfu_process_block(p_dfu_ctx, &block);
    } while (0);
}

/***************************************************************************************************
 * @section Message helpers
 **************************************************************************************************/

/** @brief Set CoAP URI option on a given message.
 *
 *  @param[inout] p_message  A pointer to CoAP message.
 *  @param[in]    p_resource An URI as NULL terminated string which should be converted to CoAP options.
 *
 *  @return NRF_SUCCESS if succesful, error code otherwise.
 */
static uint32_t set_uri_opt(coap_message_t * p_message, const char * p_resource)
{
    uint32_t     err_code;
    const char * p_start = p_resource;
    const char * p_end;
    uint32_t     len;

    if (*p_start == '/')
    {
        p_start++;
    }

    do {
        p_end = strchr(p_start, '/');
        if (p_end)
        {
            len = p_end - p_start;
        }
        else
        {
            len = strlen(p_start);
        }

        err_code = coap_message_opt_str_add(p_message,
                                            COAP_OPT_URI_PATH,
                                            (uint8_t *) p_start,
                                            len);
        p_start += (len + 1);

    } while ((err_code == NRF_SUCCESS) && p_end);

    return err_code;
}

/**@brief Get next message id.
 *
 * @return An unique message id.
 */
static uint16_t message_id_get(void)
{
    return m_coap_message_id++;
}

/**@brief Create a CoAP message with specific payload and remote.
 *
 * @param[in] p_conf      A pointer to the message configuration.
 * @param[in] p_resource  A pointer to a string with resource name.
 * @param[in] p_payload   A pointer to the message payload. NULL if message shall not contain any payload.
 * @param[in] payload_len Payload length in bytes, ignored if p_payload is NULL.
 * @param[in] p_remote    An address of the remote endpoint.
 *
 * @return A pointer to the message created or NULL if could not be created.
 */
static coap_message_t * message_create(const coap_message_conf_t * p_conf,
                                       const char                * p_resource,
                                       const uint8_t             * p_payload,
                                       uint16_t                    payload_len,
                                       const coap_remote_t       * p_remote)
{
    uint32_t         err_code;
    coap_message_t * p_message = NULL;

    do
    {
        err_code = coap_message_new(&p_message, (coap_message_conf_t *)p_conf);
        if (err_code != NRF_SUCCESS)
        {
            break;
        }

        err_code = coap_message_remote_addr_set(p_message, (coap_remote_t *)p_remote);
        if (err_code != NRF_SUCCESS)
        {
            break;
        }

        if (p_resource != NULL)
        {
            err_code = set_uri_opt(p_message, p_resource);
            if (err_code != NRF_SUCCESS)
            {
                break;
            }
        }

        if (p_payload != NULL)
        {
            err_code = coap_message_payload_set(p_message, (void *)p_payload, payload_len);
            if (err_code != NRF_SUCCESS)
            {
                break;
            }
        }
    } while (0);

    if ((err_code != NRF_SUCCESS) && (p_message != NULL))
    {
        coap_message_delete(p_message);
        p_message = NULL;
    }

    return p_message;
}

/**@brief Create an empty reset response.
 *
 * @param[in] p_request A pointer to the request.
 *
 * @return A pointer to the reset response or NULL if could not be created.
 */
static coap_message_t * empty_reset_response_create(const coap_message_t * p_request)
{
    coap_message_conf_t message_conf;

    memset(&message_conf, 0, sizeof(message_conf));

    message_conf.type             = COAP_TYPE_RST;
    message_conf.code             = COAP_CODE_EMPTY_MESSAGE;
    message_conf.id               = p_request->header.id;
    message_conf.port.port_number = DFU_UDP_PORT;

    return message_create(&message_conf, NULL, NULL, 0, &p_request->remote);
}

/**@brief Create a response with diag resource.
 *
 * @param[in] type      A message type of the response.
 * @param[in] code      A message code to send back.
 * @param[in] p_request A pointer to the request.
 *
 * @return A pointer to the response message or NULL if could not be created.
 */
static coap_message_t * diagnostic_response_create(coap_msg_type_t         type,
                                                   coap_msg_code_t         code,
                                                   const coap_message_t  * p_request)
{
    coap_message_conf_t message_conf;

    memset(&message_conf, 0, sizeof(message_conf));

    message_conf.type             = type;
    message_conf.code             = code;
    message_conf.port.port_number = DFU_UDP_PORT;
    message_conf.token_len        = p_request->header.token_len;
    memcpy(message_conf.token, p_request->token, message_conf.token_len);

    if (type == COAP_TYPE_ACK)
    {
        message_conf.id = p_request->header.id;
    }
    else
    {
        message_conf.id = message_id_get();
    }

    // Create a copy and invert endianess.
    background_dfu_diagnostic_t diag = m_dfu_ctx.dfu_diag;

    diag.state                       = m_dfu_ctx.dfu_state;
    diag.build_id                    = uint32_big_decode((const uint8_t *)&diag.build_id);
    diag.image_blocks_requested      = uint16_big_decode((const uint8_t *)&diag.image_blocks_requested);
    diag.init_blocks_requested       = uint16_big_decode((const uint8_t *)&diag.init_blocks_requested);
    diag.total_image_blocks_received = uint16_big_decode((const uint8_t *)&diag.total_image_blocks_received);
    diag.total_init_blocks_received  = uint16_big_decode((const uint8_t *)&diag.total_init_blocks_received);
    diag.triggers_received           = uint16_big_decode((const uint8_t *)&diag.triggers_received);


