evan-dp/NordicSDKs/nRF5_SDK_for_Thread_v0.11.0_84a130f/components/iot/background_dfu/transport/coap/coap_dfu.c
    return message_create(&message_conf,
                          NULL,
                          (uint8_t *)&diag,
                          sizeof(diag),
                          &p_request->remote);
}


/**@brief A function for sending CoAP messages.
 *
 * @param[inout] p_request A pointer to CoAP message which should be sent.
 */
static void coap_dfu_message_send(coap_message_t * p_message)
{
    uint32_t handle;

    NRF_LOG_DEBUG("Sending message [mid:%d]\r\n", p_message->header.id);

    if (coap_message_send(&handle, p_message) != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("Failed to send CoAP message\r\n");
    }

    coap_message_delete(p_message);
}

/**@brief A function for sending delayed CoAP messages.
 *
 * Maximum delay is specified by @ref DEFAULT_DELAY_MAX_MS.
 * In case that another message is pending for sending, the message is dropped.
 *
 * @param[inout] p_request A pointer to CoAP message which should be sent.
 */
static void coap_dfu_delayed_message_send(coap_message_t * p_message)
{
    if (!m_coap_dfu_ctx.timer_active)
    {
        uint8_t delay = (background_dfu_random() % DEFAULT_DELAY_MAX_MS) + 1;

        app_timer_start(m_send_timer, APP_TIMER_TICKS(delay), p_message);
        m_coap_dfu_ctx.timer_active = true;
    }
    else
    {
        // Drop the message in case another message is pending for transmission.
        coap_message_delete(p_message);
    }
}

/***************************************************************************************************
 * @section Resources
 **************************************************************************************************/

/**@brief A request callback for /dfu/t resource.
 *
 * This method is called when a request to trigger resource is received.
 * An implementation of @ref coap_method_callback_t function type.
 *
 * @param[in] p_resource A pointer to resource.
 * @param[in] p_request  A pointer to request.
 */
static void trigger_request_callback(coap_resource_t * p_resource, coap_message_t * p_request)
{
    NRF_LOG_INFO("DFU trigger request received\r\n");

    if (p_request->header.code != COAP_CODE_POST)
    {
        NRF_LOG_INFO("Trigger request: method not supported\r\n");
        return;
    }

    m_dfu_ctx.dfu_diag.triggers_received++;

    if (background_dfu_validate_trigger(&m_dfu_ctx, p_request->p_payload, p_request->payload_len))
    {
        m_coap_dfu_ctx.remote = p_request->remote;
        background_dfu_process_trigger(&m_dfu_ctx, p_request->p_payload, p_request->payload_len);
    }
}

/**@brief A request callback for /dfu/i resource.
 *
 * An implementation of @ref coap_method_callback_t function type.
 *
 * @param[in] p_resource A pointer to resource.
 * @param[in] p_request  A pointer to request.
 */
static void init_request_callback(coap_resource_t * p_resource, coap_message_t * p_request)
{
    coap_message_t          * p_response = NULL;
    coap_block_opt_block1_t   block_opt  = {0};

    do
    {
        // Resource only active in multicast mode firmware download state.
        if ((m_dfu_ctx.dfu_mode != BACKGROUND_DFU_MODE_MULTICAST) ||
            (m_dfu_ctx.dfu_state != BACKGROUND_DFU_DOWNLOAD_INIT_CMD))
        {
            NRF_LOG_WARNING("Init data received in invalid state: (m:%d s:%d).\r\n",
                            m_dfu_ctx.dfu_mode, m_dfu_ctx.dfu_state);

            if (!is_addr_multicast(&p_request->local))
            {
                p_response = empty_reset_response_create(p_request);
            }

            break;
        }

        if (!get_block1_opt(p_request, &block_opt))
        {
            NRF_LOG_WARNING("No block 1 option in init request message.\r\n");
        }
        else
        {
            background_dfu_block_t block;
            block.number    = block_opt.number;
            block.size      = block_opt.size;
            block.p_payload = p_request->p_payload;

#if (DFU_DEBUG_RANDOM_INIT_BLOCK_LOSS_ENABLE == 1)
            if ((background_dfu_random() % 100) >= DFU_DEBUG_RANDOM_BLOCK_LOSS_RATE)
            {
                background_dfu_process_block(&m_dfu_ctx, &block);
            }
#else  // DFU_DEBUG_RANDOM_INIT_BLOCK_LOSS_ENABLE
            background_dfu_process_block(&m_dfu_ctx, &block);
#endif // DFU_DEBUG_RANDOM_INIT_BLOCK_LOSS_ENABLE
        }

        m_dfu_ctx.dfu_diag.total_init_blocks_received++;

    } while (0);

    // Send response, if created.
    if (p_response != NULL)
    {
        coap_dfu_message_send(p_response);
    }
}

/**@brief A request callback for /dfu/f resource.
 *
 * An implementation of @ref coap_method_callback_t function type.
 *
 * @param[in] p_resource A pointer to resource.
 * @param[in] p_request  A pointer to request.
 */
static void image_request_callback(coap_resource_t * p_resource, coap_message_t * p_request)
{
    coap_message_t          * p_response = NULL;
    coap_block_opt_block1_t   block_opt = {0};

    do
    {
        // Resource only active in multicast mode firmware download state.
        if ((m_dfu_ctx.dfu_mode != BACKGROUND_DFU_MODE_MULTICAST) ||
            (m_dfu_ctx.dfu_state != BACKGROUND_DFU_DOWNLOAD_FIRMWARE))
        {
            NRF_LOG_WARNING("Image data received in invalid state: (m:%d s:%d).\r\n",
                            m_dfu_ctx.dfu_mode, m_dfu_ctx.dfu_state);

            if (!is_addr_multicast(&p_request->local))
            {
                p_response = empty_reset_response_create(p_request);
            }

            break;
        }

        if (!get_block1_opt(p_request, &block_opt))
        {
            NRF_LOG_WARNING("No block 1 option in image request message.\r\n");
        }
        else
        {
            background_dfu_block_t block;
            block.number    = block_opt.number;
            block.size      = block_opt.size;
            block.p_payload = p_request->p_payload;

#if (DFU_DEBUG_RANDOM_IMAGE_BLOCK_LOSS_ENABLE == 1)
            if ((background_dfu_random() % 100) >= DFU_DEBUG_RANDOM_BLOCK_LOSS_RATE)
            {
                background_dfu_process_block(&m_dfu_ctx, &block);
            }
#else  // DFU_DEBUG_RANDOM_IMAGE_BLOCK_LOSS_ENABLE
            background_dfu_process_block(&m_dfu_ctx, &block);
#endif // DFU_DEBUG_RANDOM_IMAGE_BLOCK_LOSS_ENABLE
        }

