evan-dp/NordicSDKs/nRF5_SDK_for_Thread_v0.11.0_84a130f/components/iot/background_dfu/transport/coap/coap_dfu.c
        m_dfu_ctx.dfu_diag.total_image_blocks_received++;

    } while (0);

    // Send response, if created.
    if (p_response != NULL)
    {
        coap_dfu_message_send(p_response);
    }
}

/**@brief A request callback for /dfu/d resource.
 *
 * An implementation of @ref coap_method_callback_t function type.
 *
 * @param[in] p_resource A pointer to resource.
 * @param[in] p_request  A pointer to request.
 */
static void diagnostic_request_callback(coap_resource_t * p_resource, coap_message_t * p_request)
{
    coap_message_t * p_response = NULL;

    // Process only CON messages.
    if (p_request->header.type == COAP_TYPE_CON)
    {
        p_response = diagnostic_response_create(COAP_TYPE_ACK, COAP_CODE_205_CONTENT, p_request);
    }
    else
    {
        p_response = diagnostic_response_create(COAP_TYPE_NON, COAP_CODE_205_CONTENT, p_request);
    }

    // Send response, if created.
    if (p_response != NULL)
    {
        coap_dfu_delayed_message_send(p_response);
    }
}

/**@brief A request callback for /dfu/r resource.
 *
 * An implementation of @ref coap_method_callback_t function type.
 *
 * @param[in] p_resource A pointer to resource.
 * @param[in] p_request  A pointer to request.
 */
static void reset_request_callback(coap_resource_t * p_resource, coap_message_t * p_request)
{
    uint32_t reset_delay_ms;

    do
    {
        if (m_dfu_ctx.dfu_state != BACKGROUND_DFU_WAIT_FOR_RESET)
        {
            NRF_LOG_WARNING("Reset command received in invalid state: (m:%d s:%d).\r\n",
                    m_dfu_ctx.dfu_mode, m_dfu_ctx.dfu_state);

            break;
        }

        if (p_request->payload_len != sizeof(uint32_t))
        {
            NRF_LOG_WARNING("Invalid reset command payload length (l:%d).\r\n",
                    p_request->payload_len);

            break;
        }

        if (!is_addr_multicast(&p_request->remote))
        {
            NRF_LOG_WARNING("Received unicast reset command. Only multicast is allowed.\r\n");

            break;
        }

        reset_delay_ms = uint32_big_decode((const uint8_t *)p_request->p_payload);

        app_timer_start(m_reset_timer, APP_TIMER_TICKS(reset_delay_ms), NULL);

    } while (0);
}

/**@brief Initialize DFU Server resources.
 *
 * @param[in] p_dfu_ctx A pointer to DFU client context.
 *
 * @return NRF_SUCCESS on success, otherwise an error code is returned.
 */
static uint32_t endpoints_init(coap_dfu_context_t * p_coap_dfu_ctx)
{
    uint32_t err_code = NRF_SUCCESS;

    do
    {
        err_code = coap_resource_create(&(p_coap_dfu_ctx->root), "/");
        if (err_code != NRF_SUCCESS)
        {
            break;
        }

        err_code = coap_resource_create(&(p_coap_dfu_ctx->trigger), TRIGGER_RESOURCE_NAME);
        if (err_code != NRF_SUCCESS)
        {
            break;
        }

        // We allow for GET method, so that the CoAP library doesn't send 'Method not allowed'
        // response. Methods other that POST are rejected in the callback.
        p_coap_dfu_ctx->trigger.permission = (COAP_PERM_POST | COAP_PERM_GET);
        p_coap_dfu_ctx->trigger.callback   = trigger_request_callback;

        err_code = coap_resource_create(&(p_coap_dfu_ctx->init), INIT_RESOURCE_NAME);
        if (err_code != NRF_SUCCESS)
        {
            break;
        }

        p_coap_dfu_ctx->init.permission = COAP_PERM_PUT;
        p_coap_dfu_ctx->init.callback   = init_request_callback;

        err_code = coap_resource_create(&(p_coap_dfu_ctx->image), IMAGE_RESOURCE_NAME);
        if (err_code != NRF_SUCCESS)
        {
            break;
        }

        p_coap_dfu_ctx->image.permission = COAP_PERM_PUT;
        p_coap_dfu_ctx->image.callback   = image_request_callback;

        err_code = coap_resource_create(&(p_coap_dfu_ctx->diagnostic), DIAG_RESOURCE_NAME);
        if (err_code != NRF_SUCCESS)
        {
            break;
        }

        p_coap_dfu_ctx->diagnostic.permission = COAP_PERM_GET;
        p_coap_dfu_ctx->diagnostic.callback   = diagnostic_request_callback;

        err_code = coap_resource_create(&(p_coap_dfu_ctx->reset), RESET_RESOURCE_NAME);
        if (err_code != NRF_SUCCESS)
        {
            break;
        }

        p_coap_dfu_ctx->reset.permission = COAP_PERM_PUT;
        p_coap_dfu_ctx->reset.callback   = reset_request_callback;

        // Create resource hierarchy.

        err_code = coap_resource_child_add(&(p_coap_dfu_ctx->root), &(p_coap_dfu_ctx->trigger));
        if (err_code != NRF_SUCCESS)
        {
            break;
        }

        err_code = coap_resource_child_add(&(p_coap_dfu_ctx->root), &(p_coap_dfu_ctx->init));
        if (err_code != NRF_SUCCESS)
        {
            break;
        }

        err_code = coap_resource_child_add(&(p_coap_dfu_ctx->root), &(p_coap_dfu_ctx->image));
        if (err_code != NRF_SUCCESS)
        {
            break;
        }

        err_code = coap_resource_child_add(&(p_coap_dfu_ctx->root), &(p_coap_dfu_ctx->diagnostic));
        if (err_code != NRF_SUCCESS)
        {
            break;
        }

        err_code = coap_resource_child_add(&(p_coap_dfu_ctx->root), &(p_coap_dfu_ctx->reset));
        if (err_code != NRF_SUCCESS)
        {
            break;
        }

        NRF_LOG_INFO("Endpoints initialized\r\n");
    } while (0);

    return err_code;
}

/***************************************************************************************************
 * @section Timer handlers
 **************************************************************************************************/

static void delayed_send_handler(void * p_context)
{
    coap_dfu_message_send((coap_message_t *)p_context);

    m_coap_dfu_ctx.timer_active = false;
}

static void delayed_reset_handler(void * p_context)
{
    NRF_LOG_INFO("Handling delayed reset\r\n");
    nrf_dfu_req_handler_reset_if_dfu_complete();
}

/***************************************************************************************************
 * @section Private API
 **************************************************************************************************/

/**@brief Create COAP GET request.
 *
 * @param[in] p_remote        A pointer to host.
 * @param[in] p_resource_path An URI of the resource which should be requested.
 * @param[in] block_size      Requested block size.
 * @param[in] block_num       Requested block number.
 * @param[in] callback        A pointer to the callback function that is called on response reception or error.
 *
 * @return A pointer to CoAP message or NULL on error.
 */
static coap_message_t * coap_dfu_create_request(coap_remote_t            * p_remote,
                                                const char               * p_resource_path,
                                                uint16_t                   block_size,
                                                uint32_t                   block_num,
                                                coap_response_callback_t   callback)
{
    uint32_t              err_code = NRF_SUCCESS;
    coap_message_t      * p_request;
    coap_message_conf_t   message_conf;

    do
    {
        memset(&message_conf, 0, sizeof(message_conf));

