evan-dp/NordicSDKs/nRF5_SDK_for_Thread_v0.11.0_84a130f/components/iot/background_dfu/transport/coap/coap_dfu.c
        if (is_addr_multicast(p_remote))
        {
            message_conf.type = COAP_TYPE_NON;
        }
        else
        {
            message_conf.type = COAP_TYPE_CON;
        }

        message_conf.code              = COAP_CODE_GET;
        message_conf.port.port_number  = DFU_UDP_PORT;
        message_conf.id                = message_id_get();
        message_conf.response_callback = callback;
        message_conf.token_len         = 2;

        m_coap_token = (uint16_t)background_dfu_random();
        memcpy(message_conf.token, &m_coap_token, 2);

        p_request = message_create(&message_conf, p_resource_path, NULL, 0, p_remote);
        if (p_request == NULL)
        {
            break;
        }

        p_request->p_arg = (void *)&m_dfu_ctx;

        if (block_size > 0)
        {
            err_code = set_block2_opt(p_request, block_size, block_num);
            if (err_code != NRF_SUCCESS)
            {
                break;
            }
        }
    } while (0);

    if ((err_code != NRF_SUCCESS) && (p_request != NULL))
    {
        coap_message_delete(p_request);
        p_request = NULL;
    }

    return p_request;
}

/**@brief Count blocks present in a block bitmap.
 *
 * @param[in] p_req_bmp A block bitmap to count.
 *
 * @return Number of blocks counted.
 */
static uint16_t blocks_count(const background_dfu_request_bitmap_t * p_req_bmp)
{
    uint16_t count = 0;

    for (uint8_t i = 0; i < p_req_bmp->size; i++)
    {
        for (uint8_t j = 0; j < 8; j++)
        {
            if ((p_req_bmp->bitmap[i] >> j) & 0x01)
            {
                count++;
            }
        }
    }

    return count;
}
/**@brief An implmentation of @ref coap_error_callback_t type. */
static void coap_error_handler(uint32_t error_code, coap_message_t * p_message)
{
    UNUSED_PARAMETER(error_code);
    UNUSED_PARAMETER(p_message);

    // Intentionally empty.
}

/**@brief Initialize CoAP protocol.
 *
 * @param[in] p_context An application specific context.
 *
 * @return NRF_SUCCESS on success, otherwise an error code is returned.
 */
static uint32_t coap_protocol_init(const void * p_context)
{
    uint32_t    err_code;
    coap_port_t local_port_list[COAP_PORT_COUNT] =
    {
        {
            .port_number = DFU_UDP_PORT
        }
    };

    coap_transport_init_t transport_params;
    transport_params.p_port_table = &local_port_list[0];
    transport_params.p_arg        = (void *)p_context;

    NRF_LOG_DEBUG("Init coap\r\n");

    m_coap_message_id = background_dfu_random();

    err_code = coap_init(otPlatRandomGet(), &transport_params);

    if (err_code == NRF_SUCCESS)
    {
        err_code = coap_error_handler_register(coap_error_handler);
    }

    return err_code;
}

void background_dfu_transport_block_request_send(background_dfu_context_t        * p_dfu_ctx,
                                                 background_dfu_request_bitmap_t * p_req_bmp)
{
    uint16_big_encode(p_req_bmp->offset, (uint8_t *)&p_req_bmp->offset);

    coap_message_conf_t message_conf;

    memset(&message_conf, 0, sizeof(message_conf));

    NRF_LOG_INFO("Sending block request!\r\n");

    message_conf.type             = COAP_TYPE_NON;
    message_conf.code             = COAP_CODE_PUT;
    message_conf.port.port_number = DFU_UDP_PORT;
    message_conf.id               = message_id_get();

    const char * p_resource_name  = NULL;

    if (m_dfu_ctx.dfu_state == BACKGROUND_DFU_DOWNLOAD_INIT_CMD)
    {
        m_dfu_ctx.dfu_diag.init_blocks_requested += blocks_count(p_req_bmp);
        p_resource_name = BITMAP_RESOURCE_NAME "/" INIT_RESOURCE_NAME;
    }
    else if (m_dfu_ctx.dfu_state == BACKGROUND_DFU_DOWNLOAD_FIRMWARE)
    {
        p_resource_name = BITMAP_RESOURCE_NAME "/" IMAGE_RESOURCE_NAME;
        m_dfu_ctx.dfu_diag.image_blocks_requested += blocks_count(p_req_bmp);
    }

    coap_message_t * p_message =  message_create(&message_conf,
                                                 p_resource_name,
                                                 (uint8_t *)(&p_req_bmp->offset),
                                                 sizeof(p_req_bmp->bitmap) + sizeof(uint16_t),
                                                 &m_coap_dfu_ctx.remote);
    if (p_message != NULL)
    {
        coap_dfu_message_send(p_message);
    }
}

uint32_t background_dfu_random(void)
{
    return otPlatRandomGet();
}

void background_dfu_transport_state_update(background_dfu_context_t * p_dfu_ctx)
{
    switch (p_dfu_ctx->dfu_state)
    {
        case BACKGROUND_DFU_DOWNLOAD_TRIG:
            m_coap_dfu_ctx.p_resource_path = TRIGGER_RESOURCE_NAME;
            m_coap_dfu_ctx.handler         = handle_trigger_response;
            break;

        case BACKGROUND_DFU_DOWNLOAD_INIT_CMD:
            m_coap_dfu_ctx.p_resource_path = INIT_RESOURCE_NAME;
            m_coap_dfu_ctx.handler         = handle_block_response;
            break;

        case BACKGROUND_DFU_DOWNLOAD_FIRMWARE:
            m_coap_dfu_ctx.p_resource_path = IMAGE_RESOURCE_NAME;
            m_coap_dfu_ctx.handler         = handle_block_response;
            break;

        case BACKGROUND_DFU_WAIT_FOR_RESET:
            break;

        default:
            NRF_LOG_WARNING("Unhandled state in background_dfu_transport_state_update (s: %s).",
                    (uint32_t)background_dfu_state_to_string(p_dfu_ctx->dfu_state));
    }
}

void background_dfu_transport_send_request(background_dfu_context_t * p_dfu_ctx)
{
    uint16_t block_size = (p_dfu_ctx->dfu_state == BACKGROUND_DFU_DOWNLOAD_TRIG) ?
                            0 : DEFAULT_BLOCK_SIZE;

    coap_message_t * p_request = coap_dfu_create_request(&m_coap_dfu_ctx.remote,
                                                         m_coap_dfu_ctx.p_resource_path,
                                                         block_size,
                                                         p_dfu_ctx->block_num,
                                                         m_coap_dfu_ctx.handler);

    if (p_request != NULL)
    {
        NRF_LOG_INFO("Requesting [%s] (block:%u mid:%d)\r\n",
                    (uint32_t)m_coap_dfu_ctx.p_resource_path,
                    p_dfu_ctx->block_num,
                    p_request->header.id);

        coap_dfu_delayed_message_send(p_request);
    }
    else
    {
        NRF_LOG_ERROR("Failed to create a request.")
    }
}

/***************************************************************************************************
 * @section Public API
 **************************************************************************************************/

void background_dfu_handle_error(void)
{
    coap_dfu_handle_error();
}

__WEAK void coap_dfu_handle_error(void)
{
    // Intentionally empty.
}

void coap_dfu_diagnostic_get(struct background_dfu_diagnostic *p_diag)
{
    if (p_diag)
    {
        memcpy(p_diag, &m_dfu_ctx.dfu_diag, sizeof(background_dfu_diagnostic_t));
        p_diag->state = m_dfu_ctx.dfu_state;
    }
}

uint32_t coap_dfu_trigger(const coap_remote_t * p_remote)
{
    NRF_LOG_INFO("Triggering DFU\r\n");

    if (m_dfu_ctx.dfu_state != BACKGROUND_DFU_IDLE)
    {
        NRF_LOG_WARNING("Invalid state\r\n");
        return NRF_ERROR_INVALID_STATE;
    }

    if (p_remote != NULL)
    {
        memcpy(&m_coap_dfu_ctx.remote, p_remote, sizeof(*p_remote));
    }
    else
    {
        memcpy(&m_coap_dfu_ctx.remote.addr, REALM_LOCAL_ADDR, 16);
        m_coap_dfu_ctx.remote.port_number = DFU_UDP_PORT;
    }

    // Transition from DFU_IDLE to DFU_DOWNLOAD_TRIG.
    return background_dfu_handle_event(&m_dfu_ctx, BACKGROUND_DFU_EVENT_TRANSFER_COMPLETE);
}

uint32_t coap_dfu_init(const void * p_context)
{
    uint32_t err_code;

    do
    {
        memset(&m_coap_dfu_ctx, 0 , sizeof(m_coap_dfu_ctx));

        err_code = coap_protocol_init(p_context);
        if (err_code != NRF_SUCCESS)
        {
            break;
        }

        err_code = endpoints_init(&m_coap_dfu_ctx);
        if (err_code != NRF_SUCCESS)
        {
            break;
        }

        nrf_dfu_settings_init(false);
        nrf_dfu_req_handler_init();

        background_dfu_state_init(&m_dfu_ctx);

        app_timer_create(&m_send_timer, APP_TIMER_MODE_SINGLE_SHOT, delayed_send_handler);
        app_timer_create(&m_reset_timer, APP_TIMER_MODE_SINGLE_SHOT, delayed_reset_handler);
    } while (0);

    return err_code;
}

void coap_dfu_reset_state(void)
{
    background_dfu_reset_state(&m_dfu_ctx);
}

/** @} */
